In [231]:
# 판다스 설치
!pip install pandas

Requirement already satisfied: pandas in c:\users\krcea\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\krcea\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\krcea\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\krcea\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\krcea\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\krcea\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [232]:
import pandas

In [233]:
import pandas

In [234]:
import pandas

In [235]:
# 시리즈(series)

menu = pandas.Series(["비빔밥", "김치찌개", "된장찌개"])
menu

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

In [236]:
type(menu)

pandas.core.series.Series

In [237]:
price = pandas.Series([1000,2000,3000])
price

0    1000
1    2000
2    3000
dtype: int64

In [238]:
# 데이터프레임(DataFrame)

import pandas as pd

df = pd.DataFrame({
    "메뉴" : menu,
    "가격" : price
})

df

     메뉴    가격
0   비빔밥  1000
1  김치찌개  2000
2  된장찌개  3000

In [239]:
df = pd.DataFrame({
    "메뉴" : ["비빔밥", "김치찌개", "된장찌개"],
    "가격" : [10000, 9000, 8000],
    "원산지" : ["한국", "한국", "한국"]
})

df

     메뉴     가격 원산지
0   비빔밥  10000  한국
1  김치찌개   9000  한국
2  된장찌개   8000  한국

In [240]:
# 컬럼 선택
df["메뉴"]
df["가격"]

0    10000
1     9000
2     8000
Name: 가격, dtype: int64

In [241]:
df[["메뉴","가격"]]

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [242]:
df[["메뉴"]]

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [243]:
# 02. 데이터 저장 및 불러오기
data = {
    "메뉴" : ["아메리카노", "카페라떼", "카페모카", "카푸치노", "에스프레소", "밀크티", "녹차"],
    "가격" : [4500,5000,5500,5000,4000,5900,5300],
    "칼로리" : [10,110,250,110,20,210,0]
}
df = pd.DataFrame(data)
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [244]:
# csv파일로 저장
df.to_csv("temp.csv", index = False)

In [245]:
# csv파일로 불러오기
temp = pd.read_csv("temp.csv")
temp

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [246]:
# 03 탐색적 데이터 분석(EDA)
df = pd.read_csv("temp.csv")

# 데이터의 샘플 확인

df.head() # 상위 5개의 행을 불러올 때
df.head(2) # 상위 2개

df.tail() # 하위 5개의 행을 불러올 때 
df.tail(2)

    메뉴    가격  칼로리
5  밀크티  5900  210
6   녹차  5300    0

In [247]:
# 데이터 프레임의 크기
df.shape

(7, 3)

In [248]:
# 컬럼별 자료형
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [249]:
# 상관관계 (비례 1, 반비례-1, 일정 0)
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [250]:
# 범주형 데이터(object) 탐색

#고유한 값의 개수

data = {
    "car": ["Sedan", "Suv", "Sedan", "Suv", "Suv", "Sedan", "Sedan", "Sedan", "Sedan", "Suv"],
    "size": ["S","M","M","S","L","M","S","L","M","L"]
}
df_car = pd.DataFrame(data)
df_car.head(3)

df_car.nunique()

car     2
size    3
dtype: int64

In [251]:
# 고유한 값과 갯수
df_car.value_counts()
print(df_car["car"].value_counts())
print(df_car["size"].value_counts())

car
Sedan    6
Suv      4
Name: count, dtype: int64
size
M    4
S    3
L    3
Name: count, dtype: int64

In [252]:
# 기술 통계
df.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [253]:
# 기술 통계(object 자료형)

df.describe(include="object")
df.describe(include="O")

           메뉴
count       7
unique      7
top     아메리카노
freq        1

In [254]:
# 04 자료형 변환

data = {
    "메뉴" : ["아메리카노", "카페라떼", "카페모카", "카푸치노", "에스프레소", "밀크티", "녹차"],
    "가격" : [4500.0,5000.0,5500.0,5000.0,4000.0,5900.0,5300.0],
    "칼로리" : [10,110,250,110,20,210,0]
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 300.0+ bytes

In [255]:
df["가격"]=df["가격"].astype(int)

In [256]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [257]:
df["가격"]=df["가격"].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 300.0+ bytes

In [258]:
# 05 새로운 컬럼(y열) 추가

df = pd.read_csv("temp.csv")
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [259]:
df["new"] = 0
df

      메뉴    가격  칼로리  new
0  아메리카노  4500   10    0
1   카페라떼  5000  110    0
2   카페모카  5500  250    0
3   카푸치노  5000  110    0
4  에스프레소  4000   20    0
5    밀크티  5900  210    0
6     녹차  5300    0    0

In [260]:
# 기존 컬럼을 사용한 계산

discount = 0.2
df["할인가"] = df["가격"] * (1-discount)
df

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
1   카페라떼  5000  110    0  4000.0
2   카페모카  5500  250    0  4400.0
3   카푸치노  5000  110    0  4000.0
4  에스프레소  4000   20    0  3200.0
5    밀크티  5900  210    0  4720.0
6     녹차  5300    0    0  4240.0

In [261]:
# 06 데이터 삭제

df = pd.read_csv("temp.csv")
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [ ]:
# 행(x행) 삭제

df= df.drop(1, axis=0)
# df = df.drop(1, axis=0, inplace=True)
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [263]:
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [264]:
df=df.drop("칼로리", axis=1)

In [265]:
df

      메뉴    가격
0  아메리카노  4500
2   카페모카  5500
3   카푸치노  5000
4  에스프레소  4000
5    밀크티  5900
6     녹차  5300